[
  {
    "title": "【主動積極的個人特質】",
    "content": [
      "我是陳品維，自從有機會觸到前端，看著自己所撰寫的程式碼渲染成的網頁是一件十分有趣的且開心的事情，我自認是一個心思細膩的人，所以寫網頁時常常會思考要如何最佳化使用者體驗與流程，並從錯誤中學習和接觸新的技術；做事注重流程與細節，能夠找出錯誤或問題並進行改善，不斷提升工作品質；投入前端勢必要不斷接觸新的技術，面臨問題要能夠立即採取行動，並有效管理工作進度及流程，這些都是屬於我的個人特質，相信能夠勝任這份職缺，發揮自身所學。"
    ]
  },
  {
    "title": "【初次接觸網頁與開發】",
    "content": [
      "以前玩遊戲時，當時加入的遊戲公會在每次打公會戰前會長都會花許多時間在編組上，於是我尋思可以設計一個帶有分組功能的程式，能更有效率的進行分組，在將這個構思與會長討論後他亦對我的想法予以肯定與支援，最終製作完成的成品也實際應用到了公會裡面，讓每次進行分組所花費的時間大幅減少，之後就不斷的改善畫面與優化程式，並且開始去了解相關技術。"
    ]
  },
  {
    "title": "【反思並轉換跑道】",
    "content": [
      "進入職場做了一段時間後，發覺自己對於現在的工作並不喜歡，開始思考是否應該繼續下去時，想到之前做過一些程式的小功能，於是決定在下班空閒時間自主學習 程式語言 相關技術，由於學生時期就有接觸過程式，所以有一定基礎在學習上也能更容易上手。",
      "為什麼會選擇前端呢 ? 對我而言，前後端不論選哪個其實都可以，當時是因為由於前端可以呈現出畫面，對於學習來說可以更好的去理解，於是我選擇了前端。"
    ]
  },
  {
    "title": "【培養經歷和溝通能力】",
    "content": [
      "在我的第一份前端工作上，主要面向的是工廠的客戶，我負責的內容是將設技師給出的畫面呈現出來並且通過後端傳遞資料，在這份工作中，能夠學習到與小組成員共同開發的經歷，熟悉工廠用程式模組建置的流程與前端開發技術，將其統整並轉化為網頁呈現，在與設計師和後端接觸的過程中培養我溝通協調能力，同時專注傾聽各方面的訊息，釐清各方意見的差異並取得共識，對於未來與人溝通交流皆是很大的助益。此次的經驗也是我首次使用 Vue 開發前端，對我了解前端運作原理與框架的使用經驗有長足的進步，而git部分則是SourceTree，在處理 合併 與 版本控制 都相較使用指令來的方便且快速。"
    ]
  },
  {
    "title": "【在職場中學習與成長】",
    "content": [
      "在先前的工作上，由於面對的是工廠類型的客戶，因此相較於一般網頁呈現，更多的圍繞在Search搜索、Form表單與Table列表，如何使用這三個功能來查詢與呈現大量資訊。",
      "當遇到特殊或是沒遇過的需求時，需要思考能不能夠實現，有不會的技術就要去學，在這個過程中，我學會了使用 Promise、async await 來處理API和使用 Export.js 和 Chart.js 來呈現圖表與匯出資料。"
    ]
  },
  {
    "title": "【持續深耕網頁技術】",
    "content": [
      "使用 Vue3 搭配 Vue Router 開發單頁應用程式，網站內的旅遊與美食資料則是透過 Fetch API 介接交通部的 TDX API，將取得的資料經過處理後呈現在畫面上供使用者瀏覽食宿、景點、活動等資訊，並嵌入 Google Map 方便使用者規劃路線。"
    ]
  },
  {
    "title": "【補足能力、展望未來】",
    "content": [
      "在不斷發展的數位時代，學習新技能和不斷提升自己的能力變得至關重要。除了網頁技術，我渴望探索AI相關領域，以培養自己的第二專長。AI技術的應用正在廣泛擴展，並在各個行業中發揮關鍵作用。這包括自動化、數據分析、自然語言處理等領域，都將對未來職業生涯產生深遠影響。透過學習AI技術，我將能更好地應對未來的職業挑戰，並提供更多價值給我的雇主和客戶。",
      "此外，外語能力也是我未來職業生涯中想要不斷加強的一個方面。擁有流利的外語能力，特別是英語，對於跨國合作、閱讀原文書籍、參與國際會議以及與外國人進行有效溝通都至關重要。這種能力將使我更具競爭力，開啟更多跨國機會，並有助於擴大我的專業網絡。",
      "這不僅關係到個人成長，還關係到在不斷變化的職場環境中保持競爭優勢。透過學習新技能和不斷提高自己的能力，我期待著迎接未來的挑戰，並實現個人和專業生涯的成功。"
    ]
  }
]